# Data Analysis with SQL Project 2

# Crimes analysis with postgre sql

## Introduction and Project Goals

In this project, we will explore crimes database using sql qureies on postgre sql . The dataset contains more than 800k rows  rows of real raod crimes with 37 different features across 2 tables (realated to crimes) The features contains various data which can help us to analyze their relationships with no of crimes happeening across the ciy in each borough(including borough type, day of week/month, etc). Most of the dataset is already cleaned so in this case we may directly proceed towards our analysis

In [ ]:
# Surpress warnings:
def warn(*args, **kwargs):
    pass
import warnings
warnings.warn = warn

!pip install ipython-sql
import sqlite3
!pip install tqdm seaborn skillsnetwork pandas numpy scikit-learn

In [ ]:
!pip install psycopg2 ipython-sql

# Import the required libraries
from sqlalchemy import create_engine
%load_ext sql

# Set up the PostgreSQL connection
host = 'localhost'
database = 'Demo'

user = 'postgres'
password = '12345'
port = '5432'

# Create the connection string
conn_string = f'postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}'

# Create the SQLAlchemy engine
engine = create_engine(conn_string)

# Connect to the database
conn = engine.connect()

# Set up the IPython-SQL extension
%sql $conn_string

# Execute SQL queries using the %sql or %%sql magic commands

# Multi-line SQL query
%sql SELECT * FROM crimes LIMIT 1;

# Close the database connection
conn.close()

In [15]:
%%sql
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'crimes' or table_name='population'

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
37 rows affected.

[('cmpln_to_dt',),
 ('pop_1980',),
 ('pop_1950',),
 ('pop_1990',),
 ('report_dt',),
 ('pop_2000',),
 ('pop_1960',),
 ('pop_2010',),
 ('cmpln_fr_dt',),
 ('pop_2020',),
 ('pop_1970',),
 ('premises',),
 ('x_cord',),
 ('y_cord',),
 ('latitude',),
 ('longitude',),
 ('lat_lon',),
 ('borough',),
 ('pop_share_1950',),
 ('pop_share_1960',),
 ('pop_share_1970',),
 ('pop_share_1980',),
 ('pop_share_1990',),
 ('pop_share_2000',),
 ('pop_share_2010',),
 ('cmpln_num',),
 ('pop_share_2020',),
 ('offense_code',),
 ('offense_desc',),
 ('internal_code',),
 ('offense_sum',),
 ('crime_success',),
 ('offense_level',),
 ('jurisdiction',),
 ('borough',),
 ('precinct',),
 ('location',)]

In [11]:
%%sql
select count(*)
from crimes

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
1 rows affected.

[(817941,)]

### Dateset size

Our datset contains 2 tables(population and crimes) and >800k rows of data with more than 25 features

In [4]:
%%sql
select *
from population
limit 1

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
1 rows affected.

[('BRONX', 1451277, '18.39%', 1424815, '18.31%', 1471701, '18.64%', 1168972, '16.53%', 1203789, '16.44%', 1332650, '16.64%', 1385108, '16.80%', 1446788, '16.92%')]

%%sql
select *
from crimes
limit 1

In [5]:
%%sql
select * from crimes limit 1

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
1 rows affected.

[('641637920', datetime.date(2015, 12, 31), datetime.date(2015, 12, 31), datetime.date(2015, 12, 31), '344', 'ASSAULT 3 & RELATED OFFENSES', '101.0', 'ASSAULT 3', 'COMPLETED', 'MISDEMEANOR', 'N.Y. POLICE DEPT', 'MANHATTAN', '13.0', 'FRONT OF', 'OTHER', '987606.0', '208148.0', '40.7380024', '-73.98789129', '(40.7380024, -73.98789129)')]

The latest crime in the database

In [6]:
%sql select cmpln_fr_dt from crimes order by 1 desc limit 1

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
1 rows affected.

[(datetime.date(2015, 12, 31),)]

 The oldest crime in database

In [29]:
%sql select cmpln_fr_dt from crimes order by 1 asc limit 1

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
1 rows affected.

[(datetime.date(1910, 9, 20),)]

Lets see the total complaints by each borough

In [30]:
%%sql
select borough, count(cmpln_fr_dt) as total_complaints
from crimes
group by 1
order by 2 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('BROOKLYN', 259436),
 ('MANHATTAN', 189659),
 ('QUEENS', 174136),
 ('BRONX', 157332),
 ('STATEN ISLAND', 37378)]

As illustrated above the highest crimes are recored in brooklyn. Whie Staten island have the lowest no of total crimes in the whole dataset. Lets explore further

Lets check number of crimes by each year(only after 2012)

In [41]:
%%sql
SELECT EXTRACT(YEAR FROM cmpln_fr_dt) AS year, count(cmpln_num) as total_complains
FROM crimes
where EXTRACT(YEAR FROM cmpln_fr_dt) > 2012
group by year

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
3 rows affected.

[(Decimal('2013'), 65966),
 (Decimal('2014'), 378086),
 (Decimal('2015'), 372031)]

for each borough , lets explore the number of felony crimes

In [57]:
%%sql
select borough, offense_level, count(cmpln_num) as total_complaints
from crimes
where extract(year from cmpln_fr_dt) > 2012 and offense_level='FELONY'
group by borough, offense_level
order by 3 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('BROOKLYN', 'FELONY', 87696),
 ('MANHATTAN', 'FELONY', 61095),
 ('QUEENS', 'FELONY', 59622),
 ('BRONX', 'FELONY', 44772),
 ('STATEN ISLAND', 'FELONY', 9083)]

## Crimes realtion with date

Lets chceck in whcich month do most crinmes occur

In [64]:
%%sql
select extract(month from cmpln_fr_dt) as month, count(cmpln_num) as total_complaints
from crimes
where extract(year from cmpln_fr_dt) > 2011
group by month
order by 2 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
12 rows affected.

[(Decimal('11'), 90084),
 (Decimal('12'), 86836),
 (Decimal('8'), 70748),
 (Decimal('7'), 69734),
 (Decimal('10'), 68709),
 (Decimal('5'), 67930),
 (Decimal('9'), 66633),
 (Decimal('6'), 65626),
 (Decimal('4'), 61711),
 (Decimal('3'), 60614),
 (Decimal('1'), 57566),
 (Decimal('2'), 50686)]

In [5]:
%%sql
select borough, extract(month from cmpln_fr_dt) as month, count(cmpln_num) as total_complaints
from crimes
where extract(year from cmpln_fr_dt) > 2011
group by borough, month
order by 1 asc, 3 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
60 rows affected.

[('BRONX', Decimal('11'), 17492),
 ('BRONX', Decimal('12'), 16216),
 ('BRONX', Decimal('8'), 14040),
 ('BRONX', Decimal('10'), 13488),
 ('BRONX', Decimal('7'), 13417),
 ('BRONX', Decimal('9'), 13330),
 ('BRONX', Decimal('5'), 12648),
 ('BRONX', Decimal('6'), 12454),
 ('BRONX', Decimal('4'), 11785),
 ('BRONX', Decimal('3'), 11600),
 ('BRONX', Decimal('1'), 10996),
 ('BRONX', Decimal('2'), 9673),
 ('BROOKLYN', Decimal('11'), 28385),
 ('BROOKLYN', Decimal('12'), 27539),
 ('BROOKLYN', Decimal('8'), 22659),
 ('BROOKLYN', Decimal('7'), 22280),
 ('BROOKLYN', Decimal('10'), 21814),
 ('BROOKLYN', Decimal('5'), 21784),
 ('BROOKLYN', Decimal('9'), 21021),
 ('BROOKLYN', Decimal('6'), 20875),
 ('BROOKLYN', Decimal('4'), 19586),
 ('BROOKLYN', Decimal('3'), 19225),
 ('BROOKLYN', Decimal('1'), 18194),
 ('BROOKLYN', Decimal('2'), 15726),
 ('MANHATTAN', Decimal('11'), 20742),
 ('MANHATTAN', Decimal('12'), 20299),
 ('MANHATTAN', Decimal('7'), 16139),
 ('MANHATTAN', Decimal('8'), 16134),
 ('MANHATTAN', Decimal('5'), 15955),
 ('MANHATTAN', Decimal('10'), 15700),
 ('MANHATTAN', Decimal('9'), 15283),
 ('MANHATTAN', Decimal('6'), 15255),
 ('MANHATTAN', Decimal('4'), 14308),
 ('MANHATTAN', Decimal('3'), 14043),
 ('MANHATTAN', Decimal('1'), 13450),
 ('MANHATTAN', Decimal('2'), 12121),
 ('QUEENS', Decimal('11'), 19348),
 ('QUEENS', Decimal('12'), 18742),
 ('QUEENS', Decimal('7'), 14847),
 ('QUEENS', Decimal('8'), 14750),
 ('QUEENS', Decimal('10'), 14651),
 ('QUEENS', Decimal('5'), 14402),
 ('QUEENS', Decimal('6'), 13934),
 ('QUEENS', Decimal('9'), 13899),
 ('QUEENS', Decimal('4'), 13155),
 ('QUEENS', Decimal('3'), 12789),
 ('QUEENS', Decimal('1'), 12374),
 ('QUEENS', Decimal('2'), 11025),
 ('STATEN ISLAND', Decimal('11'), 4117),
 ('STATEN ISLAND', Decimal('12'), 4040),
 ('STATEN ISLAND', Decimal('8'), 3165),
 ('STATEN ISLAND', Decimal('5'), 3141),
 ('STATEN ISLAND', Decimal('6'), 3108),
 ('STATEN ISLAND', Decimal('9'), 3100),
 ('STATEN ISLAND', Decimal('10'), 3056),
 ('STATEN ISLAND', Decimal('7'), 3051),
 ('STATEN ISLAND', Decimal('3'), 2957),
 ('STATEN ISLAND', Decimal('4'), 2877),
 ('STATEN ISLAND', Decimal('1'), 2552),
 ('STATEN ISLAND', Decimal('2'), 2141)]

above data confirms that this happens across all borough , the trend is more or less similar across all borough where the crime rate is highest in ending months of the year. Lets check for days of months

In [70]:
%%sql
select borough, extract(day from cmpln_fr_dt) as day, count(cmpln_num) as total_complaints
from crimes
where extract(year from cmpln_fr_dt) > 2012
group by borough, day
order by 1 asc, 3 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
155 rows affected.

[('BRONX', Decimal('1'), 5932),
 ('BRONX', Decimal('15'), 5441),
 ('BRONX', Decimal('20'), 5374),
 ('BRONX', Decimal('22'), 5352),
 ('BRONX', Decimal('12'), 5323),
 ('BRONX', Decimal('14'), 5298),
 ('BRONX', Decimal('18'), 5266),
 ('BRONX', Decimal('11'), 5217),
 ('BRONX', Decimal('8'), 5214),
 ('BRONX', Decimal('13'), 5201),
 ('BRONX', Decimal('17'), 5183),
 ('BRONX', Decimal('4'), 5173),
 ('BRONX', Decimal('21'), 5168),
 ('BRONX', Decimal('16'), 5156),
 ('BRONX', Decimal('25'), 5144),
 ('BRONX', Decimal('7'), 5144),
 ('BRONX', Decimal('10'), 5138),
 ('BRONX', Decimal('5'), 5135),
 ('BRONX', Decimal('19'), 5111),
 ('BRONX', Decimal('2'), 5042),
 ('BRONX', Decimal('24'), 5030),
 ('BRONX', Decimal('28'), 5030),
 ('BRONX', Decimal('23'), 5029),
 ('BRONX', Decimal('6'), 5000),
 ('BRONX', Decimal('26'), 4967),
 ('BRONX', Decimal('27'), 4966),
 ('BRONX', Decimal('9'), 4965),
 ('BRONX', Decimal('3'), 4947),
 ('BRONX', Decimal('29'), 4662),
 ('BRONX', Decimal('30'), 4564),
 ('BRONX', Decimal('31'), 2847),
 ('BROOKLYN', Decimal('1'), 10336),
 ('BROOKLYN', Decimal('15'), 8832),
 ('BROOKLYN', Decimal('14'), 8741),
 ('BROOKLYN', Decimal('20'), 8729),
 ('BROOKLYN', Decimal('12'), 8695),
 ('BROOKLYN', Decimal('18'), 8637),
 ('BROOKLYN', Decimal('21'), 8597),
 ('BROOKLYN', Decimal('5'), 8580),
 ('BROOKLYN', Decimal('10'), 8564),
 ('BROOKLYN', Decimal('16'), 8536),
 ('BROOKLYN', Decimal('17'), 8536),
 ('BROOKLYN', Decimal('22'), 8528),
 ('BROOKLYN', Decimal('6'), 8519),
 ('BROOKLYN', Decimal('9'), 8508),
 ('BROOKLYN', Decimal('11'), 8471),
 ('BROOKLYN', Decimal('19'), 8464),
 ('BROOKLYN', Decimal('13'), 8417),
 ('BROOKLYN', Decimal('7'), 8399),
 ('BROOKLYN', Decimal('2'), 8364),
 ('BROOKLYN', Decimal('24'), 8345),
 ('BROOKLYN', Decimal('28'), 8344),
 ('BROOKLYN', Decimal('4'), 8332),
 ('BROOKLYN', Decimal('8'), 8307),
 ('BROOKLYN', Decimal('23'), 8299),
 ('BROOKLYN', Decimal('25'), 8297),
 ('BROOKLYN', Decimal('3'), 8253),
 ('BROOKLYN', Decimal('27'), 8199),
 ('BROOKLYN', Decimal('26'), 8148),
 ('BROOKLYN', Decimal('30'), 7719),
 ('BROOKLYN', Decimal('29'), 7517),
 ('BROOKLYN', Decimal('31'), 4643),
 ('MANHATTAN', Decimal('1'), 7708),
 ('MANHATTAN', Decimal('15'), 6737),
 ('MANHATTAN', Decimal('14'), 6561),
 ('MANHATTAN', Decimal('20'), 6510),
 ('MANHATTAN', Decimal('12'), 6473),
 ('MANHATTAN', Decimal('16'), 6367),
 ('MANHATTAN', Decimal('22'), 6364),
 ('MANHATTAN', Decimal('10'), 6323),
 ('MANHATTAN', Decimal('18'), 6294),
 ('MANHATTAN', Decimal('21'), 6234),
 ('MANHATTAN', Decimal('19'), 6209),
 ('MANHATTAN', Decimal('11'), 6203),
 ('MANHATTAN', Decimal('17'), 6182),
 ('MANHATTAN', Decimal('7'), 6180),
 ('MANHATTAN', Decimal('13'), 6178),
 ('MANHATTAN', Decimal('5'), 6165),
 ('MANHATTAN', Decimal('23'), 6105),
 ('MANHATTAN', Decimal('4'), 6084),
 ('MANHATTAN', Decimal('9'), 6081),
 ('MANHATTAN', Decimal('6'), 6075),
 ('MANHATTAN', Decimal('8'), 6053),
 ('MANHATTAN', Decimal('28'), 6027),
 ('MANHATTAN', Decimal('3'), 5984),
 ('MANHATTAN', Decimal('24'), 5974),
 ('MANHATTAN', Decimal('2'), 5933),
 ('MANHATTAN', Decimal('27'), 5916),
 ('MANHATTAN', Decimal('25'), 5893),
 ('MANHATTAN', Decimal('26'), 5844),
 ('MANHATTAN', Decimal('30'), 5576),
 ('MANHATTAN', Decimal('29'), 5500),
 ('MANHATTAN', Decimal('31'), 3480),
 ('QUEENS', Decimal('1'), 7374),
 ('QUEENS', Decimal('15'), 6177),
 ('QUEENS', Decimal('10'), 5876),
 ('QUEENS', Decimal('20'), 5844),
 ('QUEENS', Decimal('22'), 5838),
 ('QUEENS', Decimal('12'), 5813),
 ('QUEENS', Decimal('18'), 5732),
 ('QUEENS', Decimal('21'), 5707),
 ('QUEENS', Decimal('23'), 5687),
 ('QUEENS', Decimal('5'), 5686),
 ('QUEENS', Decimal('17'), 5685),
 ('QUEENS', Decimal('11'), 5676),
 ('QUEENS', Decimal('14'), 5674),
 ('QUEENS', Decimal('16'), 5669),
 ('QUEENS', Decimal('9'), 5667),
 ('QUEENS', Decimal('6'), 5642),
 ('QUEENS', Decimal('4'), 5641),
 ('QUEENS', Decimal('13'), 5641),
 ('QUEENS', Decimal('25'), 5620),
 ('QUEENS', Decimal('19'), 5601),
 ('QUEENS', Decimal('7'), 5589),
 ('QUEENS', Decimal('28'), 5584),
 ('QUEENS', Decimal('2'), 5567),
 ('QUEENS', Decimal('3'), 5545),
 ('QUEENS', Decimal('8'), 5523),
 ('QUEENS', Decimal('26'), 5511),
 ('QUEENS', Decimal('24'), 5436),
 ('QUEENS', Decimal('27'), 5331),
 ('QUEENS', Decimal('30'), 5185),
 ('QUEENS', Decimal('29'), 4985),
 ('QUEENS', Decimal('31'), 3217),
 ('STATEN ISLAND', Decimal('1'), 1638),
 ('STATEN ISLAND', Decimal('15'), 1342),
 ('STATEN ISLAND', Decimal('20'), 1338),
 ('STATEN ISLAND', Decimal('18'), 1284),
 ('STATEN ISLAND', Decimal('16'), 1254),
 ('STATEN ISLAND', Decimal('10'), 1247),
 ('STATEN ISLAND', Decimal('4'), 1243),
 ('STATEN ISLAND', Decimal('9'), 1241),
 ('STATEN ISLAND', Decimal('11'), 1240),
 ('STATEN ISLAND', Decimal('2'), 1239),
 ('STATEN ISLAND', Decimal('22'), 1238),
 ('STATEN ISLAND', Decimal('14'), 1231),
 ('STATEN ISLAND', Decimal('21'), 1226),
 ('STATEN ISLAND', Decimal('17'), 1222),
 ('STATEN ISLAND', Decimal('7'), 1215),
 ('STATEN ISLAND', Decimal('25'), 1212),
 ('STATEN ISLAND', Decimal('8'), 1207),
 ('STATEN ISLAND', Decimal('12'), 1195),
 ('STATEN ISLAND', Decimal('5'), 1189),
 ('STATEN ISLAND', Decimal('19'), 1182),
 ('STATEN ISLAND', Decimal('28'), 1178),
 ('STATEN ISLAND', Decimal('6'), 1173),
 ('STATEN ISLAND', Decimal('27'), 1168),
 ('STATEN ISLAND', Decimal('13'), 1152),
 ('STATEN ISLAND', Decimal('23'), 1151),
 ('STATEN ISLAND', Decimal('24'), 1146),
 ('STATEN ISLAND', Decimal('30'), 1137),
 ('STATEN ISLAND', Decimal('26'), 1133),
 ('STATEN ISLAND', Decimal('3'), 1132),
 ('STATEN ISLAND', Decimal('29'), 1079),
 ('STATEN ISLAND', Decimal('31'), 640)]

the most number of complains for each of the boroughs are on the first month , while the rest of the data isnt conclusive enough
Lets try this for month

In [81]:
%%sql
SELECT offense_level,
       CASE 
           WHEN EXTRACT(DAY FROM cmpln_fr_dt) <= 7 THEN 'week1'
           WHEN EXTRACT(DAY FROM cmpln_fr_dt) > 7 AND EXTRACT(DAY FROM cmpln_fr_dt) <= 14 THEN 'week2'
           WHEN EXTRACT(DAY FROM cmpln_fr_dt) > 14 AND EXTRACT(DAY FROM cmpln_fr_dt) <= 21 THEN 'week3'
           WHEN EXTRACT(DAY FROM cmpln_fr_dt) > 21 AND EXTRACT(DAY FROM cmpln_fr_dt) <= 31 THEN 'week4&5'
       END AS week_of_month,
       COUNT(cmpln_fr_dt) AS total_complaints
FROM crimes
WHERE EXTRACT(YEAR FROM cmpln_fr_dt) > 2011
GROUP BY offense_level, week_of_month
ORDER BY 1, total_complaints DESC;



#include borough and offense level to in select and group  by to check for each borough and offense level

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
12 rows affected.

[('FELONY', 'week4&5', 79845),
 ('FELONY', 'week3', 61079),
 ('FELONY', 'week1', 61073),
 ('FELONY', 'week2', 60690),
 ('MISDEMEANOR', 'week4&5', 135720),
 ('MISDEMEANOR', 'week1', 106973),
 ('MISDEMEANOR', 'week3', 106610),
 ('MISDEMEANOR', 'week2', 104711),
 ('VIOLATION', 'week4&5', 30371),
 ('VIOLATION', 'week1', 23452),
 ('VIOLATION', 'week3', 23293),
 ('VIOLATION', 'week2', 23060)]

## Crimes relation with areas

As illustrated above the ending week of the month , crimes are at their highest, while week 2 and 3 are relatively peaceful across each borough

In [30]:
%%sql
SELECT c.borough, c.premises, c.total_complaints, c.row_num
FROM (
  SELECT borough, premises, total_complaints, ROW_NUMBER() OVER (PARTITION BY borough ORDER BY total_complaints DESC) AS row_num
  FROM (
    SELECT borough, premises, COUNT(cmpln_num) AS total_complaints
    FROM crimes
    WHERE premises NOT IN ('RESIDENCE - APT. HOUSE', 'RESIDENCE-HOUSE', 'OTHER', 'BAR/NIGHT CLUB')
    GROUP BY borough, premises
  ) AS subquery
) AS c
WHERE c.row_num < 11
ORDER BY c.borough, c.total_complaints DESC;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
50 rows affected.

[('BRONX', 'STREET', 55019, 1),
 ('BRONX', 'RESIDENCE - PUBLIC HOUSING', 14329, 2),
 ('BRONX', 'DEPARTMENT STORE', 2837, 3),
 ('BRONX', 'TRANSIT - NYC SUBWAY', 2811, 4),
 ('BRONX', 'CHAIN STORE', 2491, 5),
 ('BRONX', 'GROCERY/BODEGA', 2378, 6),
 ('BRONX', 'COMMERCIAL BUILDING', 2260, 7),
 ('BRONX', 'PARK/PLAYGROUND', 2229, 8),
 ('BRONX', 'PUBLIC SCHOOL', 1880, 9),
 ('BRONX', 'PUBLIC BUILDING', 1239, 10),
 ('BROOKLYN', 'STREET', 85402, 1),
 ('BROOKLYN', 'RESIDENCE - PUBLIC HOUSING', 22449, 2),
 ('BROOKLYN', 'COMMERCIAL BUILDING', 5664, 3),
 ('BROOKLYN', 'CHAIN STORE', 4914, 4),
 ('BROOKLYN', 'GROCERY/BODEGA', 4659, 5),
 ('BROOKLYN', 'TRANSIT - NYC SUBWAY', 4412, 6),
 ('BROOKLYN', 'DEPARTMENT STORE', 4177, 7),
 ('BROOKLYN', 'PUBLIC SCHOOL', 2647, 8),
 ('BROOKLYN', 'RESTAURANT/DINER', 2483, 9),
 ('BROOKLYN', 'PARK/PLAYGROUND', 2440, 10),
 ('MANHATTAN', 'STREET', 49348, 1),
 ('MANHATTAN', 'RESIDENCE - PUBLIC HOUSING', 18727, 2),
 ('MANHATTAN', 'COMMERCIAL BUILDING', 8303, 3),
 ('MANHATTAN', 'CHAIN STORE', 8145, 4),
 ('MANHATTAN', 'TRANSIT - NYC SUBWAY', 7220, 5),
 ('MANHATTAN', 'DEPARTMENT STORE', 5723, 6),
 ('MANHATTAN', 'RESTAURANT/DINER', 5492, 7),
 ('MANHATTAN', 'CLOTHING/BOUTIQUE', 5192, 8),
 ('MANHATTAN', 'PARK/PLAYGROUND', 3123, 9),
 ('MANHATTAN', 'DRUG STORE', 2919, 10),
 ('QUEENS', 'STREET', 56861, 1),
 ('QUEENS', 'RESIDENCE - PUBLIC HOUSING', 5049, 2),
 ('QUEENS', 'COMMERCIAL BUILDING', 4603, 3),
 ('QUEENS', 'DEPARTMENT STORE', 4248, 4),
 ('QUEENS', 'CHAIN STORE', 3477, 5),
 ('QUEENS', 'TRANSIT - NYC SUBWAY', 2247, 6),
 ('QUEENS', 'GROCERY/BODEGA', 2204, 7),
 ('QUEENS', 'RESTAURANT/DINER', 1834, 8),
 ('QUEENS', 'DRUG STORE', 1804, 9),
 ('QUEENS', 'PARKING LOT/GARAGE (PRIVATE)', 1551, 10),
 ('STATEN ISLAND', 'STREET', 9096, 1),
 ('STATEN ISLAND', 'RESIDENCE - PUBLIC HOUSING', 1751, 2),
 ('STATEN ISLAND', 'DEPARTMENT STORE', 1099, 3),
 ('STATEN ISLAND', 'COMMERCIAL BUILDING', 975, 4),
 ('STATEN ISLAND', 'CHAIN STORE', 867, 5),
 ('STATEN ISLAND', 'GROCERY/BODEGA', 550, 6),
 ('STATEN ISLAND', 'PUBLIC SCHOOL', 524, 7),
 ('STATEN ISLAND', 'PARKING LOT/GARAGE (PUBLIC)', 453, 8),
 ('STATEN ISLAND', 'RESTAURANT/DINER', 326, 9),
 ('STATEN ISLAND', 'PARKING LOT/GARAGE (PRIVATE)', 276, 10)]

In [40]:
%%sql
SELECT c.dayname, c.premises, c.total_complaints, c.row_num
FROM (
  SELECT TO_CHAR(cmpln_fr_dt, 'Dy') AS dayname, premises, COUNT(cmpln_num) AS total_complaints,
      ROW_NUMBER() OVER (PARTITION BY TO_CHAR(cmpln_fr_dt, 'Dy') ORDER BY COUNT(cmpln_num) DESC) AS row_num
  FROM crimes
  WHERE premises NOT IN ('RESIDENCE - APT. HOUSE', 'RESIDENCE-HOUSE', 'OTHER', 'BAR/NIGHT CLUB')
  GROUP BY dayname, premises
) AS c
WHERE c.row_num < 6
ORDER BY c.dayname , c.total_complaints DESC

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
35 rows affected.

[('Fri', 'STREET', 39461, 1),
 ('Fri', 'RESIDENCE - PUBLIC HOUSING', 9380, 2),
 ('Fri', 'COMMERCIAL BUILDING', 3840, 3),
 ('Fri', 'CHAIN STORE', 2939, 4),
 ('Fri', 'DEPARTMENT STORE', 2778, 5),
 ('Mon', 'STREET', 31932, 1),
 ('Mon', 'RESIDENCE - PUBLIC HOUSING', 8037, 2),
 ('Mon', 'COMMERCIAL BUILDING', 3365, 3),
 ('Mon', 'CHAIN STORE', 2805, 4),
 ('Mon', 'DEPARTMENT STORE', 2685, 5),
 ('Sat', 'STREET', 40961, 1),
 ('Sat', 'RESIDENCE - PUBLIC HOUSING', 9314, 2),
 ('Sat', 'CHAIN STORE', 2891, 3),
 ('Sat', 'DEPARTMENT STORE', 2600, 4),
 ('Sat', 'COMMERCIAL BUILDING', 2445, 5),
 ('Sun', 'STREET', 36370, 1),
 ('Sun', 'RESIDENCE - PUBLIC HOUSING', 8482, 2),
 ('Sun', 'CHAIN STORE', 2364, 3),
 ('Sun', 'DEPARTMENT STORE', 2304, 4),
 ('Sun', 'COMMERCIAL BUILDING', 1951, 5),
 ('Thu', 'STREET', 35855, 1),
 ('Thu', 'RESIDENCE - PUBLIC HOUSING', 8995, 2),
 ('Thu', 'COMMERCIAL BUILDING', 3394, 3),
 ('Thu', 'CHAIN STORE', 2881, 4),
 ('Thu', 'TRANSIT - NYC SUBWAY', 2657, 5),
 ('Tue', 'STREET', 34670, 1),
 ('Tue', 'RESIDENCE - PUBLIC HOUSING', 8882, 2),
 ('Tue', 'COMMERCIAL BUILDING', 3369, 3),
 ('Tue', 'CHAIN STORE', 2965, 4),
 ('Tue', 'TRANSIT - NYC SUBWAY', 2597, 5),
 ('Wed', 'STREET', 36477, 1),
 ('Wed', 'RESIDENCE - PUBLIC HOUSING', 9215, 2),
 ('Wed', 'COMMERCIAL BUILDING', 3441, 3),
 ('Wed', 'CHAIN STORE', 3049, 4),
 ('Wed', 'TRANSIT - NYC SUBWAY', 2790, 5)]

These are the top 5 crimes happening on each day of week
As seen the street and residence - public housing are in top 2 fow all days of the week
Lets exclude them, and then analyze again

In [42]:
%%sql
SELECT c.dayname, c.premises, c.total_complaints, c.row_num
FROM (
  SELECT TO_CHAR(cmpln_fr_dt, 'Dy') AS dayname, premises, COUNT(cmpln_num) AS total_complaints,
      ROW_NUMBER() OVER (PARTITION BY TO_CHAR(cmpln_fr_dt, 'Dy') ORDER BY COUNT(cmpln_num) DESC) AS row_num
  FROM crimes
  WHERE premises NOT IN ('RESIDENCE - APT. HOUSE', 'RESIDENCE-HOUSE', 'OTHER', 'BAR/NIGHT CLUB', 'RESIDENCE - PUBLIC HOUSING', 'STREET')
  GROUP BY premises, dayname
) AS c
WHERE c.row_num < 6
ORDER BY c.dayname , c.total_complaints DESC

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
35 rows affected.

[('Fri', 'COMMERCIAL BUILDING', 3840, 1),
 ('Fri', 'CHAIN STORE', 2939, 2),
 ('Fri', 'DEPARTMENT STORE', 2778, 3),
 ('Fri', 'TRANSIT - NYC SUBWAY', 2742, 4),
 ('Fri', 'GROCERY/BODEGA', 1919, 5),
 ('Mon', 'COMMERCIAL BUILDING', 3365, 1),
 ('Mon', 'CHAIN STORE', 2805, 2),
 ('Mon', 'DEPARTMENT STORE', 2685, 3),
 ('Mon', 'TRANSIT - NYC SUBWAY', 1933, 4),
 ('Mon', 'GROCERY/BODEGA', 1597, 5),
 ('Sat', 'CHAIN STORE', 2891, 1),
 ('Sat', 'DEPARTMENT STORE', 2600, 2),
 ('Sat', 'COMMERCIAL BUILDING', 2445, 3),
 ('Sat', 'TRANSIT - NYC SUBWAY', 2277, 4),
 ('Sat', 'RESTAURANT/DINER', 1902, 5),
 ('Sun', 'CHAIN STORE', 2364, 1),
 ('Sun', 'DEPARTMENT STORE', 2304, 2),
 ('Sun', 'COMMERCIAL BUILDING', 1951, 3),
 ('Sun', 'RESTAURANT/DINER', 1730, 4),
 ('Sun', 'TRANSIT - NYC SUBWAY', 1694, 5),
 ('Thu', 'COMMERCIAL BUILDING', 3394, 1),
 ('Thu', 'CHAIN STORE', 2881, 2),
 ('Thu', 'TRANSIT - NYC SUBWAY', 2657, 3),
 ('Thu', 'DEPARTMENT STORE', 2513, 4),
 ('Thu', 'GROCERY/BODEGA', 1791, 5),
 ('Tue', 'COMMERCIAL BUILDING', 3369, 1),
 ('Tue', 'CHAIN STORE', 2965, 2),
 ('Tue', 'TRANSIT - NYC SUBWAY', 2597, 3),
 ('Tue', 'DEPARTMENT STORE', 2571, 4),
 ('Tue', 'GROCERY/BODEGA', 1658, 5),
 ('Wed', 'COMMERCIAL BUILDING', 3441, 1),
 ('Wed', 'CHAIN STORE', 3049, 2),
 ('Wed', 'TRANSIT - NYC SUBWAY', 2790, 3),
 ('Wed', 'DEPARTMENT STORE', 2633, 4),
 ('Wed', 'GROCERY/BODEGA', 1742, 5)]

There seems to be some pattern, lets analyze again by first excluding working days, and then weekends
to see if there is any link of premsies and day of week

In [43]:
%%sql
SELECT c.dayname, c.premises, c.total_complaints, c.row_num
FROM (
  SELECT TO_CHAR(cmpln_fr_dt, 'Dy') AS dayname, premises, COUNT(cmpln_num) AS total_complaints,
      ROW_NUMBER() OVER (PARTITION BY TO_CHAR(cmpln_fr_dt, 'Dy') ORDER BY COUNT(cmpln_num) DESC) AS row_num
  FROM crimes
  WHERE premises NOT IN ('RESIDENCE - APT. HOUSE', 'RESIDENCE-HOUSE', 'OTHER', 'BAR/NIGHT CLUB', 'RESIDENCE - PUBLIC HOUSING', 'STREET') and
    TO_CHAR(cmpln_fr_dt, 'Dy') not in('Mon', 'Tue', 'Wed', 'Thu', 'Fri')
  GROUP BY premises, dayname
) AS c
WHERE c.row_num < 6
ORDER BY c.dayname , c.total_complaints DESC

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
10 rows affected.

[('Sat', 'CHAIN STORE', 2891, 1),
 ('Sat', 'DEPARTMENT STORE', 2600, 2),
 ('Sat', 'COMMERCIAL BUILDING', 2445, 3),
 ('Sat', 'TRANSIT - NYC SUBWAY', 2277, 4),
 ('Sat', 'RESTAURANT/DINER', 1902, 5),
 ('Sun', 'CHAIN STORE', 2364, 1),
 ('Sun', 'DEPARTMENT STORE', 2304, 2),
 ('Sun', 'COMMERCIAL BUILDING', 1951, 3),
 ('Sun', 'RESTAURANT/DINER', 1730, 4),
 ('Sun', 'TRANSIT - NYC SUBWAY', 1694, 5)]

The top 3 crimes locations on weekends are Chain store, Departmen store and Commercial Building

Now lets check top 3 for weekdays

In [44]:
%%sql
SELECT c.dayname, c.premises, c.total_complaints, c.row_num
FROM (
  SELECT TO_CHAR(cmpln_fr_dt, 'Dy') AS dayname, premises, COUNT(cmpln_num) AS total_complaints,
      ROW_NUMBER() OVER (PARTITION BY TO_CHAR(cmpln_fr_dt, 'Dy') ORDER BY COUNT(cmpln_num) DESC) AS row_num
  FROM crimes
  WHERE premises NOT IN ('RESIDENCE - APT. HOUSE', 'RESIDENCE-HOUSE', 'OTHER', 'BAR/NIGHT CLUB', 'RESIDENCE - PUBLIC HOUSING', 'STREET') and
    TO_CHAR(cmpln_fr_dt, 'Dy') not in('Sat', 'Sun')
  GROUP BY premises, dayname
) AS c
WHERE c.row_num < 6
ORDER BY c.dayname , c.total_complaints DESC

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
25 rows affected.

[('Fri', 'COMMERCIAL BUILDING', 3840, 1),
 ('Fri', 'CHAIN STORE', 2939, 2),
 ('Fri', 'DEPARTMENT STORE', 2778, 3),
 ('Fri', 'TRANSIT - NYC SUBWAY', 2742, 4),
 ('Fri', 'GROCERY/BODEGA', 1919, 5),
 ('Mon', 'COMMERCIAL BUILDING', 3365, 1),
 ('Mon', 'CHAIN STORE', 2805, 2),
 ('Mon', 'DEPARTMENT STORE', 2685, 3),
 ('Mon', 'TRANSIT - NYC SUBWAY', 1933, 4),
 ('Mon', 'GROCERY/BODEGA', 1597, 5),
 ('Thu', 'COMMERCIAL BUILDING', 3394, 1),
 ('Thu', 'CHAIN STORE', 2881, 2),
 ('Thu', 'TRANSIT - NYC SUBWAY', 2657, 3),
 ('Thu', 'DEPARTMENT STORE', 2513, 4),
 ('Thu', 'GROCERY/BODEGA', 1791, 5),
 ('Tue', 'COMMERCIAL BUILDING', 3369, 1),
 ('Tue', 'CHAIN STORE', 2965, 2),
 ('Tue', 'TRANSIT - NYC SUBWAY', 2597, 3),
 ('Tue', 'DEPARTMENT STORE', 2571, 4),
 ('Tue', 'GROCERY/BODEGA', 1658, 5),
 ('Wed', 'COMMERCIAL BUILDING', 3441, 1),
 ('Wed', 'CHAIN STORE', 3049, 2),
 ('Wed', 'TRANSIT - NYC SUBWAY', 2790, 3),
 ('Wed', 'DEPARTMENT STORE', 2633, 4),
 ('Wed', 'GROCERY/BODEGA', 1742, 5)]

On weekdays Transit have somehwat more no of crimes than on weekends, this maybe becayse of mroe people travelling on weekdays on public transport

## Percentage share in crimes

Lets do some analysis on percentage share of total and felony crimes for each borough. And then we will further analyze it with thir populaton share and per capita

In [54]:
%%sql
SELECT c.borough, c.total_complaints, (c.total_complaints::decimal / t.total_crimes) * 100 AS percentage
FROM (
  SELECT borough, COUNT(cmpln_num) AS total_complaints
  FROM crimes
  GROUP BY borough
) AS c
CROSS JOIN (
  SELECT COUNT(cmpln_num) AS total_crimes
  FROM crimes
) AS t;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('BRONX', 157332, Decimal('19.23512820606865287300')),
 ('BROOKLYN', 259436, Decimal('31.71818016213883397500')),
 ('MANHATTAN', 189659, Decimal('23.18736926013000937700')),
 ('QUEENS', 174136, Decimal('21.28955511461095604700')),
 ('STATEN ISLAND', 37378, Decimal('4.56976725705154772800'))]

Percentage share of crimes for each borough
Lets add avg no of felony crimes , and do a compariso with total and avg no of crimes with each borough

In [27]:
%%sql
SELECT c.borough, c.total_complaints_by_borough, (c.total_complaints_by_borough::decimal/c3.total_crimes) * 100 AS avg_total_crimes,
c2.felony_crimes_borough, (c2.felony_crimes_borough::decimal/c4.total_felony_crime) * 100 AS avg_felony_crimes
FROM 
    (SELECT borough, COUNT(cmpln_num) AS total_complaints_by_borough
    FROM crimes 
    GROUP BY borough) AS c
JOIN
    (SELECT borough, COUNT(cmpln_num) AS felony_crimes_borough
    FROM crimes
    WHERE offense_level = 'FELONY'
    GROUP BY borough) AS c2
    ON c.borough = c2.borough
CROSS JOIN
    (SELECT COUNT(cmpln_num) AS total_crimes
     FROM crimes) AS c3
CROSS JOIN
    (SELECT COUNT(cmpln_num) AS total_felony_crime
    FROM crimes 
    WHERE offense_level = 'FELONY') AS c4;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('BRONX', 157332, Decimal('19.23512820606865287300'), 44965, Decimal('17.07255027033594556800')),
 ('BROOKLYN', 259436, Decimal('31.71818016213883397500'), 88062, Decimal('33.43584836887187898700')),
 ('MANHATTAN', 189659, Decimal('23.18736926013000937700'), 61333, Decimal('23.28723953587266873200')),
 ('QUEENS', 174136, Decimal('21.28955511461095604700'), 59876, Decimal('22.73403802928133163200')),
 ('STATEN ISLAND', 37378, Decimal('4.56976725705154772800'), 9140, Decimal('3.47032379563817508000'))]

Every borough have more or less similar percentage of felony crimes as there share in total crimes , except brroklyn which is have a share slightly above its total share of crimes for felony crimes

In [32]:
%%sql
select *
from population

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('Bronx', 1451277, '18.39%', 1424815, '18.31%', 1471701, '18.64%', 1168972, '16.53%', 1203789, '16.44%', 1332650, '16.64%', 1385108, '16.80%', 1446788, '16.92%'),
 ('Brooklyn', 2738175, '34.70%', 2627319, '33.76%', 2602012, '32.96%', 2230936, '31.55%', 2300664, '31.42%', 2465326, '30.78%', 2552911, '30.97%', 2648452, '30.97%'),
 ('Manhattan', 1960101, '24.84%', 1698281, '21.82%', 1539233, '19.50%', 1428285, '20.20%', 1487536, '20.31%', 1537195, '19.20%', 1585873, '19.24%', 1638281, '19.16%'),
 ('Queens', 1550849, '19.65%', 1809578, '23.25%', 1986473, '25.16%', 1891325, '26.75%', 1951598, '26.65%', 2229379, '27.84%', 2250002, '27.30%', 2330295, '27.25%'),
 ('Staten Island', 191555, '2.43%', 221991, '2.85%', 295443, '3.74%', 352121, '4.98%', 378977, '5.18%', 443728, '5.54%', 468730, '5.69%', 487155, '5.70%')]

In [ ]:
%%sql
UPDATE population
SET borough = UPPER(borough)

Uppercasing all borough values in population table to make joining happen between the two table based on the comman values(borough)

In [62]:
%%sql
SELECT p.borough,
       p.pop_2010,
       p.pop_share_2010,
       (c.total_complaints_by_borough::decimal / c3.total_crimes) * 100 AS total_crimes_percentage,
       (c2.felony_crimes_borough::decimal / c4.total_felony_crime) * 100 AS felony_crimes_percentage
FROM population p
LEFT JOIN (
    SELECT borough, COUNT(cmpln_num) AS total_complaints_by_borough
    FROM crimes
    GROUP BY borough
) AS c ON p.borough = c.borough
LEFT JOIN (
    SELECT borough, COUNT(cmpln_num) AS felony_crimes_borough
    FROM crimes
    WHERE offense_level = 'FELONY'
    GROUP BY borough
) AS c2 ON p.borough = c2.borough
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_crimes
    FROM crimes
) AS c3
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_felony_crime
    FROM crimes
    WHERE offense_level = 'FELONY'
) AS c4;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('BRONX', 1385108, '16.80%', Decimal('19.23512820606865287300'), Decimal('17.07255027033594556800')),
 ('BROOKLYN', 2552911, '30.97%', Decimal('31.71818016213883397500'), Decimal('33.43584836887187898700')),
 ('MANHATTAN', 1585873, '19.24%', Decimal('23.18736926013000937700'), Decimal('23.28723953587266873200')),
 ('QUEENS', 2250002, '27.30%', Decimal('21.28955511461095604700'), Decimal('22.73403802928133163200')),
 ('STATEN ISLAND', 468730, '5.69%', Decimal('4.56976725705154772800'), Decimal('3.47032379563817508000'))]

In above table it is illustrated , Manhattan have a realtively higher percentage of crimes as compared with their population share
While quuesns and staten island have lower crimes share than their population share which shows they did better among all boroughs

In [64]:
%%sql
UPDATE population
SET borough = UPPER(borough);SELECT c.borough,
       p.pop_2010,
       p.pop_share_2010,
       round((c.total_complaints_by_borough::decimal / c3.total_crimes) * 100) AS total_crimes_percentage,
       (c2.felony_crimes_borough::decimal / c4.total_felony_crime) * 100 AS felony_crimes_percentage
FROM (
    SELECT borough, COUNT(cmpln_num) AS total_complaints_by_borough
    FROM crimes
    GROUP BY borough
) AS c
JOIN population p ON p.borough = c.borough
JOIN (
    SELECT borough, COUNT(cmpln_num) AS felony_crimes_borough
    FROM crimes
    WHERE offense_level = 'FELONY'
    GROUP BY borough
) AS c2 ON c.borough = c2.borough
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_crimes
    FROM crimes
) AS c3
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_felony_crime
    FROM crimes
    WHERE offense_level = 'FELONY'
) AS c4;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.
5 rows affected.

[('BRONX', 1385108, '16.80%', Decimal('19'), Decimal('17.07255027033594556800')),
 ('BROOKLYN', 2552911, '30.97%', Decimal('32'), Decimal('33.43584836887187898700')),
 ('MANHATTAN', 1585873, '19.24%', Decimal('23'), Decimal('23.28723953587266873200')),
 ('QUEENS', 2250002, '27.30%', Decimal('21'), Decimal('22.73403802928133163200')),
 ('STATEN ISLAND', 468730, '5.69%', Decimal('5'), Decimal('3.47032379563817508000'))]

In [86]:
%%sql
SELECT c.borough, p.pop_2010, pop_share_2010, c.total_complaints_by_borough, (c.total_complaints_by_borough::decimal / c3.total_crimes) * 100 AS avg_total_crimes,
       c2.felony_crimes_borough, (c2.felony_crimes_borough::decimal / c4.total_felony_crime) * 100 AS avg_felony_crimes
FROM population p
JOIN (
    SELECT borough, COUNT(cmpln_num) AS total_complaints_by_borough
    FROM crimes
    GROUP BY borough
) AS c ON p.borough = c.borough
JOIN (
    SELECT borough, COUNT(cmpln_num) AS felony_crimes_borough
    FROM crimes
    WHERE offense_level = 'FELONY'
    GROUP BY borough
) AS c2 ON c.borough = c2.borough
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_crimes
    FROM crimes
) AS c3
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_felony_crime
    FROM crimes
    WHERE offense_level = 'FELONY'
) AS c4;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('BRONX', 1385108, '16.80%', 157332, Decimal('19.23512820606865287300'), 44965, Decimal('17.07255027033594556800')),
 ('BROOKLYN', 2552911, '30.97%', 259436, Decimal('31.71818016213883397500'), 88062, Decimal('33.43584836887187898700')),
 ('MANHATTAN', 1585873, '19.24%', 189659, Decimal('23.18736926013000937700'), 61333, Decimal('23.28723953587266873200')),
 ('QUEENS', 2250002, '27.30%', 174136, Decimal('21.28955511461095604700'), 59876, Decimal('22.73403802928133163200')),
 ('STATEN ISLAND', 468730, '5.69%', 37378, Decimal('4.56976725705154772800'), 9140, Decimal('3.47032379563817508000'))]

In [102]:
%%sql
select c.borough, p.pop_2010, total_crimes_borough, felony_crimes_borough,
round((total_crimes_borough::decimal/p.pop_2010) * 1000) as crimes_per_capita,
round((felony_crimes_borough::decimal/p.pop_2010) * 1000) as felony_crimes_per_capita


from population p

join
(select borough, count(cmpln_num) as total_crimes_borough
from crimes
group by borough) as c on p.borough=c.borough

join
(select borough, count(cmpln_num) as felony_crimes_borough
from crimes
where offense_level='FELONY'
group by borough) as c2 on c.borough=c2.borough

cross join
(select count(cmpln_num) as total_complaints
from crimes) as c3

cross join
(select count(cmpln_num) as total_felony
from crimes
where offense_level='FELONY') as c4

order by 5 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('MANHATTAN', 1585873, 189659, 61333, Decimal('120'), Decimal('39')),
 ('BRONX', 1385108, 157332, 44965, Decimal('114'), Decimal('32')),
 ('BROOKLYN', 2552911, 259436, 88062, Decimal('102'), Decimal('34')),
 ('STATEN ISLAND', 468730, 37378, 9140, Decimal('80'), Decimal('19')),
 ('QUEENS', 2250002, 174136, 59876, Decimal('77'), Decimal('27'))]

## Crimes per capita

We did analyze with percentage share in crimes, but now lets analyze it with per capita, as it will be a better metric for  presnetation and analysis with population data

In [101]:
%%sql
select c.borough, p.pop_2010, total_crimes_borough, felony_crimes_borough,
round((total_crimes_borough::decimal/p.pop_2010) * 1000) as crimes_per_capita,
round((felony_crimes_borough::decimal/p.pop_2010) * 1000) as felony_crimes_per_capita


from population p

join
(select borough, count(cmpln_num) as total_crimes_borough
from crimes
group by borough) as c on p.borough=c.borough

join
(select borough, count(cmpln_num) as felony_crimes_borough
from crimes
where offense_level='FELONY'
group by borough) as c2 on c.borough=c2.borough

cross join
(select count(cmpln_num) as total_complaints
from crimes) as c3

cross join
(select count(cmpln_num) as total_felony
from crimes
where offense_level='FELONY') as c4

order by 6 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('MANHATTAN', 1585873, 189659, 61333, Decimal('120'), Decimal('39')),
 ('BROOKLYN', 2552911, 259436, 88062, Decimal('102'), Decimal('34')),
 ('BRONX', 1385108, 157332, 44965, Decimal('114'), Decimal('32')),
 ('QUEENS', 2250002, 174136, 59876, Decimal('77'), Decimal('27')),
 ('STATEN ISLAND', 468730, 37378, 9140, Decimal('80'), Decimal('19'))]

lets summarize it down, to show only most important columns

In [104]:
%%sql
SELECT c.borough,
       ROUND((total_crimes_borough::decimal / p.pop_2010) * 1000) AS crimes_per_capita,
       ROUND((felony_crimes_borough::decimal / p.pop_2010) * 1000) AS felony_crimes_per_capita
FROM population p
JOIN (
    SELECT borough, COUNT(cmpln_num) AS total_crimes_borough
    FROM crimes
    GROUP BY borough
) AS c ON p.borough = c.borough
JOIN (
    SELECT borough, COUNT(cmpln_num) AS felony_crimes_borough
    FROM crimes
    WHERE offense_level = 'FELONY'
    GROUP BY borough
) AS c2 ON c.borough = c2.borough
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_complaints
    FROM crimes
) AS c3
CROSS JOIN (
    SELECT COUNT(cmpln_num) AS total_felony
    FROM crimes
    WHERE offense_level = 'FELONY'
) AS c4
ORDER BY crimes_per_capita DESC;

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
5 rows affected.

[('MANHATTAN', Decimal('120'), Decimal('39')),
 ('BRONX', Decimal('114'), Decimal('32')),
 ('BROOKLYN', Decimal('102'), Decimal('34')),
 ('STATEN ISLAND', Decimal('80'), Decimal('19')),
 ('QUEENS', Decimal('77'), Decimal('27'))]

As shown above manhattan is the worst performing city in terms of crimes per capita, while queens and staten island relatively better

lets further analyse only the top 2 areas

1/ whre do most crimes occiur (premises)
2/ weekdays/ weekends comparison 
3/ wher do felnoy crimes occur,

In [18]:
%%sql
select c.premises, c.crime_premises, (crime_premises::decimal/c2.total_crimes) * 100 as perc

from
(select premises, count(cmpln_num) as crime_premises
from crimes
where borough in ('MANHATTAN','BRONX')
group by premises) as c

cross join
(select count(cmpln_num) as total_crimes
from crimes
where borough in ('MANHATTAN','BRONX')) as c2


order by 3 desc

 * postgresql+psycopg2://postgres:***@localhost:5432/Demo
71 rows affected.

[('STREET', 104367, Decimal('30.07772535887097936300')),
 ('RESIDENCE - APT. HOUSE', 76910, Decimal('22.16484001025963209400')),
 ('RESIDENCE - PUBLIC HOUSING', 33056, Decimal('9.52647186814643607500')),
 ('CHAIN STORE', 10636, Decimal('3.06520918409987578900')),
 ('COMMERCIAL BUILDING', 10563, Decimal('3.04417117446850206500')),
 ('OTHER', 10381, Decimal('2.99172024634644702600')),
 ('TRANSIT - NYC SUBWAY', 10031, Decimal('2.89085307688095656700')),
 ('DEPARTMENT STORE', 8560, Decimal('2.46692277321313809300')),
 ('RESIDENCE-HOUSE', 8481, Decimal('2.44415561210521310400')),
 ('RESTAURANT/DINER', 6464, Decimal('1.86287252407122951300')),
 ('BAR/NIGHT CLUB', 6222, Decimal('1.79313008118366182400')),
 ('CLOTHING/BOUTIQUE', 5729, Decimal('1.65105146819369954800')),
 ('PARK/PLAYGROUND', 5352, Decimal('1.54240311708372839600')),
 ('GROCERY/BODEGA', 4838, Decimal('1.39427247392583669300')),
 ('DRUG STORE', 3945, Decimal('1.13691709583245675000')),
 ('PUBLIC SCHOOL', 3599, Decimal('1.03720269401800046700')),
 ('HOTEL/MOTEL', 2673, Decimal('0.77033698280358856600')),
 ('PUBLIC BUILDING', 2594, Decimal('0.74756982169566357600')),
 ('FAST FOOD', 2452, Decimal('0.70664657008395030400')),
 ('FOOD SUPERMARKET', 2358, Decimal('0.67955653028464715200')),
 ('HOSPITAL', 2028, Decimal('0.58445319907432757600')),
 (None, 1838, Decimal('0.52969673565020418400')),
 ('GYM/FITNESS FACILITY', 1792, Decimal('0.51643990766331115200')),
 ('BANK', 1761, Decimal('0.50750595836779628300')),
 ('SMALL MERCHANT', 1689, Decimal('0.48675614064918110300')),
 ('STORE UNCLASSIFIED', 1445, Decimal('0.41643731393609632500')),
 ('PARKING LOT/GARAGE (PRIVATE)', 1437, Decimal('0.41413177863402797200')),
 ('PARKING LOT/GARAGE (PUBLIC)', 1259, Decimal('0.36283361816300711000')),
 ('BEAUTY & NAIL SALON', 1044, Decimal('0.30087235691992011300')),
 ('DOCTOR/DENTIST OFFICE', 897, Decimal('0.25850814574441412000')),
 ('TELECOMM. STORE', 724, Decimal('0.20865094483718597900')),
 ('BUS (NYC TRANSIT)', 703, Decimal('0.20259891466925655100')),
 ('DRY CLEANER/LAUNDRY', 684, Decimal('0.19712326832684421200')),
 ('TAXI (YELLOW LICENSED)', 672, Decimal('0.19366496537374168200')),
 ('CONSTRUCTION SITE', 662, Decimal('0.19078304624615624000')),
 ('BUS TERMINAL', 651, Decimal('0.18761293520581225400')),
 ('CHURCH', 648, Decimal('0.18674835946753662200')),
 ('GAS STATION', 539, Decimal('0.15533544097685530700')),
 ('VARIETY STORE', 528, Decimal('0.15216532993651132200')),
 ('CANDY STORE', 513, Decimal('0.14784245124513315900')),
 ('HIGHWAY/PARKWAY', 426, Decimal('0.12276975483513981600')),
 ('CHECK CASHING BUSINESS', 413, Decimal('0.11902325996927874200')),
 ('TAXI (LIVERY LICENSED)', 398, Decimal('0.11470038127790058000')),
 ('PRIVATE/PAROCHIAL SCHOOL', 384, Decimal('0.11066569449928096100')),
 ('SHOE', 373, Decimal('0.10749558345893697500')),
 ('OPEN AREAS (OPEN LOTS)', 358, Decimal('0.10317270476755881300')),
 ('JEWELRY', 354, Decimal('0.10201993711652463600')),
 ('TRANSIT FACILITY (OTHER)', 343, Decimal('0.09884982607618065000')),
 ('ATM', 336, Decimal('0.09683248268687084100')),
 ('BRIDGE', 333, Decimal('0.09596790694859520900')),
 ('STORAGE FACILITY', 289, Decimal('0.08328746278721926500')),
 ('LIQUOR STORE', 280, Decimal('0.08069373557239236800')),
 ('BUS STOP', 222, Decimal('0.06397860463239680600')),
 ('FACTORY/WAREHOUSE', 207, Decimal('0.05965572594101864300')),
 ('SOCIAL CLUB/POLICY', 206, Decimal('0.05936753402826009900')),
 ('BUS (OTHER)', 191, Decimal('0.05504465533688193600')),
 ('TUNNEL', 166, Decimal('0.04783985751791833200')),
 ('MARINA/PIER', 165, Decimal('0.04755166560515978800')),
 ('BOOK/CARD', 161, Decimal('0.04639889795412561100')),
 ('ABANDONED BUILDING', 161, Decimal('0.04639889795412561100')),
 ('VIDEO STORE', 123, Decimal('0.03544760526930093300')),
 ('FERRY/FERRY TERMINAL', 95, Decimal('0.02737823171206169600')),
 ('PHOTO/COPY', 67, Decimal('0.01930885815482245900')),
 ('TAXI/LIVERY (UNLICENSED)', 59, Decimal('0.01700332285275410600')),
 ('SYNAGOGUE', 58, Decimal('0.01671513093999556200')),
 ('MOSQUE', 38, Decimal('0.01095129268482467800')),
 ('OTHER HOUSE OF WORSHIP', 22, Decimal('0.006340222080687971734100')),
 ('LOAN COMPANY', 18, Decimal('0.005187454429653795055200')),
 ('CEMETERY', 12, Decimal('0.003458302953102530036800')),
 ('TRAMWAY', 4, Decimal('0.001152767651034176678900')),
 ('AIRPORT TERMINAL', 4, Decimal('0.001152767651034176678900'))]

Street, comemrcial buifing , and chain store are the top 3 public places where most crimes happeed in top 2 areas by crimes per capita